'''
Вправа 2
Необхідно перевезти n книг. Для транспортування можна використовувати коробки, які вміщають m книг кожна. Порахуйте, яку кількість коробок необхідно використати для перевезення всіх книг за один раз. 
Користувачем вводиться два цілих числа n і m, а програма виводить одне ціле число - мінімальну кількість коробок.

Токар Іван
'''

n = int(input("Вкажіть кількість книжок: "))
m = int(input("Вкажіть скільки книжок вміщує одна коробка: "))

boxes_min = -(-n // m)

print("Мінімальна кількість коробок: ", boxes_min)